<h3> Groupby 1 <h3>

groupby 연산이란 split, apply, combine 과정을 거쳐 연산하는 것을 말한다. 

* **df.groupby("Team")["Points"].sum()** <br>
df.groupby(묶음의 기준이 되는 컬럼)[적용받는 컬럼].적용 받는 연산
* 한개 이상의 column을 묶을 수 있다. <br>
 **df.groupby(["Team", "Year"])["Points"].sum()**

In [ ]:
import pandas as pd

In [ ]:
ipl_data = {
    "Team": [
             "Riders",
             "Riders",
             "Devils",
             "Devils",
             "Kings",
             "Kings",
             "Kings",
             "Kings",
             "Riders",
             "Royals",
             "Royals",
             "Riders"
    ],
    "Rank": [1, 2, 2, 3, 3, 4, 1, 1, 2, 4, 1, 2],
    "Year": [2014, 2015, 2014, 2015, 2014, 2015, 2016, 2017, 2016, 2014, 2015, 2017],
    "Points": [876, 789, 863, 673, 741, 812, 756, 788, 694, 701, 804, 690]
}
df = pd.DataFrame(ipl_data)

In [ ]:
df.groupby("Team")["Points"].sum()

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Points, dtype: int64

이번에는 두 개의 column을 기준으로 split해보자.

In [ ]:
# hierarchical index
h_index= df.groupby(['Team', "Year"])["Points"].sum()
h_index

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

참고로 h_index는 시리즈 객체이다

In [ ]:
type(h_index)

pandas.core.series.Series

<h4> Hierachical index  </h4>

위와 같이 두 칸의 index로 구성된 것을 hierarchical index라고 부른다.

**unstack() 함수**를 사용하면 위와 같이 두개의 index로 구성된 데이터 프레임을 한 개의 index로 구성된 데이터 프레임으로 다시 풀어줄 수 있다. <br>
**stack() 함수**를 사용하면 다시 원래대로 돌려준다.

In [ ]:
h_index.unstack()

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0  812.0  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN

In [ ]:
h_index.unstack().stack()

Team    Year
Devils  2014    863.0
        2015    673.0
Kings   2014    741.0
        2015    812.0
        2016    756.0
        2017    788.0
Riders  2014    876.0
        2015    789.0
        2016    694.0
        2017    690.0
Royals  2014    701.0
        2015    804.0
dtype: float64

**reset_index() 함수**를 사용하면 두 개의 인덱스를 열로 바꾸고 인덱스를 초기화할 수 있다.

In [ ]:
h_index.reset_index()

      Team  Year  Points
0   Devils  2014     863
1   Devils  2015     673
2    Kings  2014     741
3    Kings  2015     812
4    Kings  2016     756
5    Kings  2017     788
6   Riders  2014     876
7   Riders  2015     789
8   Riders  2016     694
9   Riders  2017     690
10  Royals  2014     701
11  Royals  2015     804

**swaplevel() 함수**를 사용해 index level을 변경할 수 있다.

In [ ]:
h_index.swaplevel()

Year  Team
2014  Devils    863
2015  Devils    673
2014  Kings     741
2015  Kings     812
2016  Kings     756
2017  Kings     788
2014  Riders    876
2015  Riders    789
2016  Riders    694
2017  Riders    690
2014  Royals    701
2015  Royals    804
Name: Points, dtype: int64

**sort_index() 함수**를 사용해 해당 level을 기준으로 행들을 정렬할 수 있다.

In [ ]:
h_index.sort_index(level=1)

Team    Year
Devils  2014    863
Kings   2014    741
Riders  2014    876
Royals  2014    701
Devils  2015    673
Kings   2015    812
Riders  2015    789
Royals  2015    804
Kings   2016    756
Riders  2016    694
Kings   2017    788
Riders  2017    690
Name: Points, dtype: int64

<h4> Hierarchical index-operation </h4>

index level을 기준으로 기본 연산 수행이 가능하다.

In [ ]:
h_index.sum()

9187

In [ ]:
h_index.sum(level=0)

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Points, dtype: int64

In [ ]:
h_index.sum(level=1)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

<h3> Groupby2 </h3>
<h4> grouped </h4>

Groupby에 의해 **Split된 상태를 아래와 같이 추출**할 수 있다.

In [ ]:
grouped = df.groupby("Team")
grouped

In [ ]:
for name, group in grouped:
  print(name)
  print(group)
  print('\n')

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673


Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
5  Kings     4  2015     812
6  Kings     1  2016     756
7  Kings     1  2017     788


Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690


Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

아래처럼 **list형태로 출력**해 볼 수 있다.

In [ ]:
list(grouped)

[('Devils',      Team  Rank  Year  Points
  2  Devils     2  2014     863
  3  Devils     3  2015     673), ('Kings',     Team  Rank  Year  Points
  4  Kings     3  2014     741
  5  Kings     4  2015     812
  6  Kings     1  2016     756
  7  Kings     1  2017     788), ('Riders',       Team  Rank  Year  Points
  0   Riders     1  2014     876
  1   Riders     2  2015     789
  8   Riders     2  2016     694
  11  Riders     2  2017     690), ('Royals',       Team  Rank  Year  Points
  9   Royals     4  2014     701
  10  Royals     1  2015     804)]

특정 key값을 가진 그룹만 추출하려면 **get_group() 함수**를 사용하면 된다.

In [ ]:
grouped.get_group('Devils')

     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673

추출된 group 정보에는 아래와 같은 유형의 apply가 가능하다.
* Aggregation: 요약된 통계정보를 추출해준다.
* Transformation: 해당 정보를 변환해준다.
* Filtration: 특정 정보를 제거해 보여주는 필터링해준다.

<h4>aggregation</h4>

In [ ]:
grouped.agg(sum)

        Rank  Year  Points
Team
Devils     5  4029    1536
Kings      9  8062    3097
Riders     7  8062    3049
Royals     5  4029    1505

In [ ]:
import numpy as np
grouped.agg(np.mean)

        Rank    Year  Points
Team
Devils  2.50  2014.5  768.00
Kings   2.25  2015.5  774.25
Riders  1.75  2015.5  762.25
Royals  2.50  2014.5  752.50

아래와 같이 특정 **column에 여러개의 function을 Apply**할 수 있다.

In [ ]:
grouped['Points'].agg([np.sum, np.mean, np.std])

         sum    mean         std
Team
Devils  1536  768.00  134.350288
Kings   3097  774.25   31.899582
Riders  3049  762.25   88.567771
Royals  1505  752.50   72.831998

위와 같은 통계학적 정보는 이전에 배웠던 **describe() 메소드**를 사용할 수도 있다.

In [ ]:
df.describe()

            Rank         Year      Points
count  12.000000    12.000000   12.000000
mean    2.166667  2015.166667  765.583333
std     1.114641     1.114641   67.849376
min     1.000000  2014.000000  673.000000
25%     1.000000  2014.000000  699.250000
50%     2.000000  2015.000000  772.000000
75%     3.000000  2016.000000  806.000000
max     4.000000  2017.000000  876.000000

In [ ]:
grouped.describe().T

Team               Devils        Kings       Riders       Royals
Rank   count     2.000000     4.000000     4.000000     2.000000
       mean      2.500000     2.250000     1.750000     2.500000
       std       0.707107     1.500000     0.500000     2.121320
       min       2.000000     1.000000     1.000000     1.000000
       25%       2.250000     1.000000     1.750000     1.750000
       50%       2.500000     2.000000     2.000000     2.500000
       75%       2.750000     3.250000     2.000000     3.250000
       max       3.000000     4.000000     2.000000     4.000000
Year   count     2.000000     4.000000     4.000000     2.000000
       mean   2014.500000  2015.500000  2015.500000  2014.500000
       std       0.707107     1.290994     1.290994     0.707107
       min    2014.000000  2014.000000  2014.000000  2014.000000
       25%    2014.250000  2014.750000  2014.750000  2014.250000
       50%    2014.500000  2015.500000  2015.500000  2014.500000
       75%    2014.750000  2016.250000  2016.250000  2014.750000
       max    2015.000000  2017.000000  2017.000000  2015.000000
Points count     2.000000     4.000000     4.000000     2.000000
       mean    768.000000   774.250000   762.250000   752.500000
       std     134.350288    31.899582    88.567771    72.831998
       min     673.000000   741.000000   690.000000   701.000000
       25%     720.500000   752.250000   693.000000   726.750000
       50%     768.000000   772.000000   741.500000   752.500000
       75%     815.500000   794.000000   810.750000   778.250000
       max     863.000000   812.000000   876.000000   804.000000

<h4> transformation </h4>

Aggregation과 달리 key값 별로 요약된 정보가 아니다. <br>
**개별 데이터의 변환을 지원한다.**

In [ ]:
score = lambda x: ((x - x.mean()) / x.std())
grouped.transform(score)

        Rank      Year    Points
0  -1.500000 -1.161895  1.284327
1   0.500000 -0.387298  0.302029
2  -0.707107 -0.707107  0.707107
3   0.707107  0.707107 -0.707107
4   0.500000 -1.161895 -1.042333
5   1.166667 -0.387298  1.183401
6  -0.833333  0.387298 -0.572108
7  -0.833333  1.161895  0.431040
8   0.500000  0.387298 -0.770596
9   0.707107 -0.707107 -0.707107
10 -0.707107  0.707107  0.707107
11  0.500000  1.161895 -0.815759

<h4> filter </h4>

아래와 같이 **filter() 함수**는 특정 조건으로 데이터를 검색할 때 사용할 수 있다.

In [ ]:
df.groupby('Team').filter(lambda x: len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

아래와 같이 **value_counts() 함수**로 그룹별 개수를 알 수 있다.

In [ ]:
df['Team'].value_counts()

Kings     4
Riders    4
Devils    2
Royals    2
Name: Team, dtype: int64

In [ ]:
df.value_counts()

Team    Rank  Year  Points
Royals  4     2014  701       1
        1     2015  804       1
Riders  2     2017  690       1
              2016  694       1
              2015  789       1
        1     2014  876       1
Kings   4     2015  812       1
        3     2014  741       1
        1     2017  788       1
              2016  756       1
Devils  3     2015  673       1
        2     2014  863       1
dtype: int64